#include <iostream>

// Task: Даден е едномерен масив А[n]. Напишете програма която намира произведението
//		 на елементите с четна стойност.N и елементите на масива се въвеждат от клавиатурата.
//		 Резултатът се извежда на екрана.

// Задача 3
int main() {
	// инициализация на променливите
	int size;
	int sum = 0;

	// въвеждане на размера на масива
	std::cout << "Enter size of array: \n";
	std::cin >> size;

	// създаване на масив с пойнтер за да работи на Visual Studio
	int* arr = new int[size];

	// въвеждане на числата в масива
	std::cout << "Enter the array numbers. \n";
	for (int j = 0; j < size; ++j) {
		std::cin >> arr[j];
	}

	// обхождане на масива елемент по елемент
	for (int i = 0; i < size; ++i) {

		// ако текущото число е четно се добавя към сумата
		if (arr[i] % 2 == 0) {
			sum += arr[i];
		}
	}

	// извеждане на резултата
	std::cout << sum << std::endl;

	return 0;
}
