#include <iostream>

//Task: Даден е едномерен масив А[n].Напишете програма която намира броят на
//      елементите с положителна стойност.N и елементите на масива се въвеждат от клавиатурата.
//      Резултатът се извежда на екрана.

int main() {
    // инициализация на променливите
    int size;
    int count = 0;

    // въвеждане на размера на масива
    std::cout << "Enter size of array: \n";
    std::cin >> size;

    // създаване на масив с пойнтер за да работи на Visual Studio
    int* arr = new int[size];

    // въвеждане на числата в масива
    std::cout << "Enter the array numbers. \n";
    for (int j = 0; j < size; ++j) {
        std::cin >> arr[j];
    }

    // обхождане на масива елемент по елемент
    for (int i = 0; i < size; ++i) {

        // ако текущото число е положително се добавя към сумата
        if (arr[i] > 0) {
            count ++;
        }
    }

    // извеждане на резултата
    std::cout << count << std::endl;

    return 0;
}
